THESE ARE JUST PROPS. THEY ARE NOT USABLE WEAPONS.

This pack contains two Heckler & Koch G3s with a large number of bodygroups, including some that allow them to be turned into different G3 variants, such as the G3A3, G3A4, G3SG1, and G3KA4. One model comes with a classic style trigger group, whilst the other has a more modern, polymer version. Aside from the trigger group, both models are identical.

Full contents list:
G3 (Classic trigger group)
G3 (Polymer trigger group)
G3 magazine

Pretty much everything that moves on the real G3 is movable on these models, either through bodygroups, the joint tool, or in most cases, both of those. There are a wide variety of stock and handguard bodygroups, ranging from the oldschool wooden versions to sliding stocks and railed handguards. The skins can be used to change the black polymer furniture to OD, and to change the magazine to look like the older version with the little raised 'ribs' along the side. 

Due to the bodygroup limit, there are no options for any optics or attachments on the rails. Conveniently, the CS:GO Weapons pack BlooCobalt and I released a while ago contains all of the optics and attachments as separate props which can be used quite easily with these models. A link to this pack is below:

http://facepunch.com/showthread.php?t=1295651

The majority of the original model parts are from Medal Of Honor: Warfighter, though some parts such as the wide handguard and the older style lower are from Medal Of Honor 2010. Most of the G3SG1 parts are from the CS:GO G3SG1.

FP Thread: 
http://facepunch.com/showthread.php?t=1443527

Credits:
Danger Close Games - Original G3 models and textures.
Valve/Hidden Path Entertainment - Original G3SG1 parts.
Alr??kinn & McTbone - Testing.
Kali - Porting, adding bodygroups, rigging, etc.

I forget the name of the person who ripped the original models from the MOH:WF and I can't find the thread they were posted in, but If you're reading this, then thank you very much.

The soldiers used in the screenshots are the MW2 Operators. They're on the workshop somewhere.